{
  "success": true,
  "note": {
    "id": "5f3723a6e21f7c3a12c2d4b9",
    "title": "Хуки в React",
    "image": "/public/images/pawel-czerwinski-VXUhQqO8u5Q-unsplash.jpg",
    "colors": [
      "#BDD5D1",
      "#748B94",
      "#082C3C"
    ],
    "content": [
      {"type": "heading-1", "content": "Добро пожаловать в Notes!"},
      {"type": "text", "content": "Рады приветствовать тебя в нашем крутом опенсорсном веб-приложении для заметок! Здесь ты сможешь организовать свои мысли, записать важные идеи и хранить все свои мысленные находки."},
      {"type": "text", "content": "Давай расскажем немного о ключевых терминах, чтобы ты легко освоился в нашей системе."},
      {"type": "heading-3", "content": "Ноуты и волты"},
      {"type": "text", "content": "Заметки в нашем приложении мы называем ноутами. Здесь ты можешь создавать и организовывать свои ноуты по разным темам и проектам."},
      {"type": "text", "content": "А для хранения ноутов у нас есть специальные хранилища, которые называются волтами. Волты - это место, где ты можешь хранить свои ноуты и будешь иметь к ним доступ в любое время."},
      {"type": "text", "content": "И у нас есть два типа волтов: публичные и приватные."},
      {"type": "heading-4", "content": "Публичные волты"},
      {"type": "text", "content": "Публичные волты - это место, где ты можешь делиться своими ноутами с другими пользователями приложения. Как только ты создашь ноут и добавишь его в публичный волт, все пользователи смогут его просмотреть."},
      {"type": "heading-4", "content": "Приватные волты"},
      {"type": "text", "content": "Приватные волты - это твои личные хранилища, доступ к которым имеешь только ты. Здесь ты можешь хранить свои личные ноуты, которые не хочешь делиться с другими."},
      {"type": "text", "content": "Теперь, когда ты знаешь основные термины, давай расскажем тебе еще об одной классной функции в приложении!"},
      {"type": "heading-3", "content": "Генератор текста с помощью ChatGPT"},
      {"type": "text", "content": "В приложении у нас есть удивительная функция - генератор текста, который работает с помощью ChatGPT. Он поможет тебе заполнить свои ноуты идеями, предложениями и даже целыми текстами."},
      {"type": "text", "content": "Для использования генератора текста нам нужен ключ от OpenAI API. Чтобы включить эту функцию, просто перейди в настройки своего профиля и укажи ключ в соответствующем поле."},
      {"type": "text", "content": "Теперь ты готов начать использовать приложение Notes! Создавай ноуты, организовывай свои мысли и не забудь воспользоваться генератором текста для дополнения своих идей. Уверены, тебе понравится!"}
    ]
  },
  "author": "",
  "config": {},
  "createAt": "",
  "homepage": "",
  "identifier": "",
  "meta": {},
  "schemaVersion": 0
}